burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_fmc.h
/* FMC_ADDR */
#define FMC_ADDR_ADDR              BITS(0,31)                                       /*!< address of flash to be erased/programmed */

/* FMC_ECCCS */
#define FMC_ECCCS_ECCADDR          BITS(16,31)                                      /*!< the offset address of double word where an ECC error is detected */
#define FMC_ECCCORIE               BIT(15)                                          /*!< one bit error correctable interrupt enable bit */
#define FMC_ECCDETIE               BIT(14)                                          /*!< two bits error detected interrupt enable bit */
#define FMC_OBECCDET               BIT(6)                                           /*!< option bytes two bits error detected flag */
#define FMC_OB_ECC                 BIT(5)                                           /*!< ECC bit error detected in reading option bytes flag */
#define FMC_OTP_ECC                BIT(4)                                           /*!< ECC bit error detected in OTP flag */
#define FMC_ECCCS_MF_ECC           BIT(3)                                           /*!< ECC bit error detected in main flash flag */
#define FMC_ECCCS_SYS_ECC          BIT(2)                                           /*!< ECC bit error detected in system memory flag */
#define FMC_ECCCS_ECCDET           BIT(1)                                           /*!< two bits error detected flag */
#define FMC_ECCCS_ECCCOR           BIT(0)                                           /*!< one bit error detected and correctable flag */

/* FMC_OBSTAT */
#define FMC_OBSTAT_OBERR           BIT(0)                                           /*!< option bytes read error */
#define FMC_OBSTAT_SPC             BIT(1)                                           /*!< option bytes security protection code */
#define FMC_OBSTAT_USER            BITS(2,9)                                        /*!< store USER of option bytes block after system reset */
#define FMC_OBSTAT_DATA            BITS(10,25)                                      /*!< store DATA of option bytes block after system reset */

/* FMC_WP */
#define FMC_WP_WP                  BITS(0,31)                                       /*!< store WP of option bytes block after system reset */

/* FMC_PID */
#define FMC_PID_PID                BITS(0,31)                                       /*!< product ID */

/* constants definitions */
/* fmc state */
typedef enum {
    FMC_READY = 0,                                                                      /*!< the operation has been completed */
    FMC_BUSY,                                                                       /*!< the operation is in progress */
    FMC_PGERR,                                                                      /*!< program error */
    FMC_PGAERR,                                                                     /*!< program alignment error */
    FMC_WPERR,                                                                      /*!< erase/program protection error */
    FMC_TOERR,                                                                      /*!< timeout error */
    FMC_OB_HSPC                                                                    /*!< high security protection */
} fmc_state_enum;

/* unlock key */
#define UNLOCK_KEY0                ((uint32_t)0x45670123U)                          /*!< unlock key 0 */
#define UNLOCK_KEY1                ((uint32_t)0xCDEF89ABU)                          /*!< unlock key 1 */

/* FMC wait state added */
#define WS_WSCNT(regval)           (BITS(0,2) & ((uint32_t)(regval)))
#define FMC_WAIT_STATE_0           WS_WSCNT(0)                                      /*!< 0 wait state added */
#define FMC_WAIT_STATE_1           WS_WSCNT(1)                                      /*!< 1 wait state added */
#define FMC_WAIT_STATE_2           WS_WSCNT(2)                                      /*!< 2 wait state added */
#define FMC_WAIT_STATE_3           WS_WSCNT(3)                                      /*!< 3 wait state added */
#define FMC_WAIT_STATE_4           WS_WSCNT(4)                                      /*!< 4 wait state added */

/* read protection configuration */
#define FMC_NSPC                   ((uint8_t)0xA5U)                                 /*!< no security protection */
#define FMC_LSPC                   ((uint8_t)0xBBU)                                 /*!< low security protection */
#define FMC_HSPC                   ((uint8_t)0xCCU)                                 /*!< high security protection */

/* option bytes software/hardware free watch dog timer */
#define OB_FWDGT_HW                ((uint8_t)0x00U)                                 /*!< hardware free watchdog */
#define OB_FWDGT_SW                ((uint8_t)0x01U)                                 /*!< software free watchdog */

/* option bytes reset or not entering deep sleep mode */
#define OB_DEEPSLEEP_RST           ((uint8_t)0x00U)                                 /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST          ((uint8_t)0x02U)                                 /*!< no reset when entering deepsleep mode */

/* option bytes reset or not entering standby mode */
#define OB_STDBY_RST               ((uint8_t)0x00U)                                 /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST              ((uint8_t)0x04U)                                 /*!< no reset when entering standby mode */

/* option bytes BOR threshold value */
#define OB_BOR_TH_VALUE3           ((uint8_t)0x00U)                                 /*!< BOR threshold value 3 */
#define OB_BOR_TH_VALUE2           ((uint8_t)0x40U)                                 /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE1           ((uint8_t)0x80U)                                 /*!< BOR threshold value 1 */
#define OB_BOR_TH_OFF              ((uint8_t)0xC0U)                                 /*!< no BOR function */

/* option bytes write protection */
#define OB_WP_NONE                 ((uint32_t)0x00000000U)                          /*!< disable all erase/program protection */
#define OB_WP_0                    ((uint32_t)0x00000001U)                          /*!< erase/program protection of sector 0  */
#define OB_WP_1                    ((uint32_t)0x00000002U)                          /*!< erase/program protection of sector 1  */
#define OB_WP_2                    ((uint32_t)0x00000004U)                          /*!< erase/program protection of sector 2  */
#define OB_WP_3                    ((uint32_t)0x00000008U)                          /*!< erase/program protection of sector 3  */
#define OB_WP_4                    ((uint32_t)0x00000010U)                          /*!< erase/program protection of sector 4  */
#define OB_WP_5                    ((uint32_t)0x00000020U)                          /*!< erase/program protection of sector 5  */
#define OB_WP_6                    ((uint32_t)0x00000040U)                          /*!< erase/program protection of sector 6  */
#define OB_WP_7                    ((uint32_t)0x00000080U)                          /*!< erase/program protection of sector 7  */
#define OB_WP_8                    ((uint32_t)0x00000100U)                          /*!< erase/program protection of sector 8  */
#define OB_WP_9                    ((uint32_t)0x00000200U)                          /*!< erase/program protection of sector 9  */
#define OB_WP_10                   ((uint32_t)0x00000400U)                          /*!< erase/program protection of sector 10 */
#define OB_WP_11                   ((uint32_t)0x00000800U)                          /*!< erase/program protection of sector 11 */
#define OB_WP_12                   ((uint32_t)0x00001000U)                          /*!< erase/program protection of sector 12 */
#define OB_WP_13                   ((uint32_t)0x00002000U)                          /*!< erase/program protection of sector 13 */
#define OB_WP_14                   ((uint32_t)0x00004000U)                          /*!< erase/program protection of sector 14 */
#define OB_WP_15                   ((uint32_t)0x00008000U)                          /*!< erase/program protection of sector 15 */
#define OB_WP_16                   ((uint32_t)0x00010000U)                          /*!< erase/program protection of sector 16 */
#define OB_WP_17                   ((uint32_t)0x00020000U)                          /*!< erase/program protection of sector 17 */
#define OB_WP_18                   ((uint32_t)0x00040000U)                          /*!< erase/program protection of sector 18 */
#define OB_WP_19                   ((uint32_t)0x00080000U)                          /*!< erase/program protection of sector 19 */
#define OB_WP_20                   ((uint32_t)0x00100000U)                          /*!< erase/program protection of sector 20 */
#define OB_WP_21                   ((uint32_t)0x00200000U)                          /*!< erase/program protection of sector 21 */
#define OB_WP_22                   ((uint32_t)0x00400000U)                          /*!< erase/program protection of sector 22 */
#define OB_WP_23                   ((uint32_t)0x00800000U)                          /*!< erase/program protection of sector 23 */
#define OB_WP_24                   ((uint32_t)0x01000000U)                          /*!< erase/program protection of sector 24 */
#define OB_WP_25                   ((uint32_t)0x02000000U)                          /*!< erase/program protection of sector 25 */
#define OB_WP_26                   ((uint32_t)0x04000000U)                          /*!< erase/program protection of sector 26 */
#define OB_WP_27                   ((uint32_t)0x08000000U)                          /*!< erase/program protection of sector 27 */
#define OB_WP_28                   ((uint32_t)0x10000000U)                          /*!< erase/program protection of sector 28 */
#define OB_WP_29                   ((uint32_t)0x20000000U)                          /*!< erase/program protection of sector 29 */
#define OB_WP_30                   ((uint32_t)0x40000000U)                          /*!< erase/program protection of sector 30 */
#define OB_WP_31                   ((uint32_t)0x80000000U)                          /*!< erase/program protection of sector 31 ~ 63 */
#define OB_WP_ALL                  ((uint32_t)0xFFFFFFFFU)                          /*!< erase/program protection of all sectors */

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)             (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define FMC_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define FMC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U)\
                                                             | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))
#define FMC_REG_VAL2(offset)            (REG32(FMC + ((uint32_t)(offset) >> 22U)))
#define FMC_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16U)

/* register offset */
#define FMC_STAT_REG_OFFSET             ((uint32_t)0x0000000CU)                         /*!< STAT register offset */
#define FMC_ECCCS_REG_OFFSET            ((uint32_t)0x00000018U)                         /*!< ECCCS register offset */
#define FMC_CTL_REG_OFFSET              ((uint32_t)0x00000010U)                         /*!< CTL register offset */
#define FMC_OBSTAT_REG_OFFSET           ((uint32_t)0x0000001CU)                         /*!< OBSTAT register offset */

/* FMC flags */
typedef enum {
    /* flags in STAT register */
    FMC_FLAG_BUSY = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 0U),                            /*!< flash busy flag */
    FMC_FLAG_PGERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 2U),                           /*!< flash program error flag */
    FMC_FLAG_PGAERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 3U),                          /*!< flash program alignment error flag */
    FMC_FLAG_WPERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 4U),                           /*!< flash erase/program protection error flag */
    FMC_FLAG_END = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 5U),                             /*!< flash end of operation flag */

